#6-1 人
小猪佩奇 = {'first_name': 'pig', 'last_name': 'small', 'age': '23', 'city': 'beijing'}
print(小猪佩奇)

#6-2 喜欢的数字

favorite_numbers = {
    'kevin': 3,
    'harden': 2,
    'rookie': 4,
    'curry': 88,
    'hardwood': 89,
    }

print(favorite_numbers)


#6-3 词汇表

词汇表 = {'亵渎': '轻慢； 不敬',
       '拨冗': '推开繁忙的工作，抽出时间',
       '贸然': '轻率的样子。指遇事不经深思熟虑,随便就决定做法',
       '风姿绰约': '形容人的風采姿容非常優美。',
       '北平': '北京旧称',
       }

print("亵渎" + ":" + "\n" + "     " + 词汇表['亵渎'])
print("拨冗" + ":" + "\n" + "     " + 词汇表['拨冗'])
print("贸然"+ ":" + "\n" + "     " + 词汇表['贸然'])
print("风姿绰约" + ":" + "\n" + "     " + 词汇表['风姿绰约'])
print("北平" + ":" + "\n" + "     " + 词汇表['北平'])
